In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("data/iris_missing.csv")

In [4]:
df_na = df.head(7)

In [5]:
df_na

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [7]:
df_na["Sepal_Length"].isna().sum()

1

In [9]:
df_na.isna()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width  Species
0         False         True          True        False    False
1         False        False         False        False    False
2         False        False         False        False     True
3         False        False         False        False    False
4         False        False         False        False     True
5         False        False         False        False    False
6          True         True          True         True    False

In [10]:
df_na.isna().sum()

Sepal_Length    1
Sepal_Width     2
Petal_Length    2
Petal_Width     1
Species         2
dtype: int64

In [11]:
df_na.isna().sum(axis=1)

0    2
1    0
2    1
3    0
4    1
5    0
6    4
dtype: int64

In [12]:
df_na.fillna(value = {"Sepal_Length": 999})

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6         999.0          NaN           NaN          NaN  setosa

In [13]:
df_na.fillna(value = {"Sepal_Length": 999, "Sepal_Width": 999})

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1        999.0           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6         999.0        999.0           NaN          NaN  setosa

In [14]:
df_na.fillna(value = 999)

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1        999.0         999.0          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     999
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     999
5           5.4          3.9           1.7          0.4  setosa
6         999.0        999.0         999.0        999.0  setosa

In [15]:
df_na["Sepal_Width"].mean()

3.3600000000000003

In [17]:
df_na.fillna(value = {"Sepal_Width" :df_na["Sepal_Width"].mean()})

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1         3.36           NaN          0.2  setosa
1           4.9         3.00           1.4          0.2  setosa
2           4.7         3.20           1.3          0.2     NaN
3           4.6         3.10           1.5          0.2  setosa
4           5.0         3.60           1.4          0.2     NaN
5           5.4         3.90           1.7          0.4  setosa
6           NaN         3.36           NaN          NaN  setosa

In [18]:
df_na.dropna()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
1           4.9          3.0           1.4          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

In [19]:
df_na.dropna(how = "all")

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [21]:
df_na.iloc[:, :-1].dropna(how="all")

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4

In [23]:
print(df["Sepal_Length"].max())
print(df["Sepal_Length"].min())
print(df["Sepal_Length"].mean())

7.9
4.3
5.853846153846154

In [24]:
print(df["Sepal_Length"].median())

5.8

In [25]:
print(df["Sepal_Length"].quantile())

5.8

In [26]:
print(df["Sepal_Length"].quantile(q=0.25)) # 제 1분위수
print(df["Sepal_Length"].quantile(q=0.50)) # 제 2분위수
print(df["Sepal_Length"].quantile(q=0.75)) # 제 3분위수

5.1
5.8
6.4

In [36]:
df.iloc[:, :-1].isna().sum().sum()

40

In [38]:
df_var = df.fillna(value = {"Sepal_Width" : df["Sepal_Width"].mean()})

In [39]:
df_var

     Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
0             5.1     3.070073           NaN          0.2     setosa
1             4.9     3.000000           1.4          0.2     setosa
2             4.7     3.200000           1.3          0.2        NaN
3             4.6     3.100000           1.5          0.2     setosa
4             5.0     3.600000           1.4          0.2        NaN
..            ...          ...           ...          ...        ...
145           6.7     3.000000           5.2          2.3  virginica
146           NaN     2.500000           NaN          NaN  virginica
147           6.5     3.000000           5.2          2.0  virginica
148           6.2     3.400000           5.4          2.3  virginica
149           5.9     3.000000           5.1          NaN  virginica

[150 rows x 5 columns]

In [42]:
df_var["Sepal_Width"].var()

0.17561945818840946

In [44]:
sl_mean = df["Sepal_Length"].mean()
sl_std = df["Sepal_Length"].std()
print(sl_mean)
print(sl_std)

5.853846153846154
0.8235759566951737

In [46]:
cond1 = df["Sepal_Length"] < (sl_mean - 1.5 * sl_std)
cond2 = df["Sepal_Length"] > (sl_mean + 1.5 * sl_std)
df_out = df.loc[(cond1) | (cond2), ]
len(df_out)

19